//抽奖人员名单
var allPerson = "刘媛媛;骆明东;钟;席雅萌;132****9643;汤安迪;刘晨曦;tomht;赖秀雯;温子龙;朱源泉;陈海畴;刘骏驰;李嘉仪;许嗣健;萧泽林;林伟鑫;陈迪航;郭卓易;牛奔;张贤健;李万和;彭烨;罗追月;陈奕岐;Dobriq Huang;梁滋欣;谭梅娟 15802034230;阮硕;卢伟强;张彩威;李媛;陈锐轩;萤火;张琦;徐启超;黄海洋;Tom Chen;杜泽嘉;林宇轩;唐万志;吴慈文;黄小鑫;黄静思;宋丹明;吴海苗;林于聪;曹菲菲;冯浩程;何乃帆;刘拔;刘少杰;颜小焱;Vive o muere;周东平;邓皓中;黄良沃;BQ;许守鑫;蔡哲伦;橙子🍊;CIPHER;岑俊峰;黄燕娟;杨玉龙;黄频;银。;曾健;梁伟健;梁水生;王伟超;李满园;韩军;何晓冰;雷蕾;吴晓亚;陈泳博;白晋豪;彭伟晋;朱罗杰;陈嘉璧;金建平;韩浩;吴学智;树黎;秋恒;张小姐;李朝晖;宋进宇;黄灿荣;林志源;李昊林;谢旻昊;单雨;吴沛;周健良;Zekun Wang;黄天成;谢统;叶志鹏;李一巧;骆龙辉;皆然.;张锦烽;刘少峰;王姗;钟耀禧;曹春壮;蔡成槟;刘斌彦;郑恩;周琰;张泽杰;尚涛;李毅伦;龚乐华;埼玉;吴伟涛;陆厚霖;伍仕勤;罗嘉豪;王会;吕顺龙;罗凯元;黄万邦;刘洋;陈锦文;吴锌冰;吴权轩;Patrick澎;张祺;罗龙彬;萧楠锋;庄凯豪;彭经纬;吴杰铤;卢青华;李梓程;邱泽槟;陈芊钎;刘嘉校;张潮辉;陈锐;麦钊汇;吴钟警;skrskrskr;张宇乐;黄一胜;廖展辉;吴小林;叶真言;冯锦;高王祥浩;李红艳;刘青;郑柏鑫;黄卓岚;李石华;甘香乐;何荣良;殷文琦;谢元亮;周小涵;张权正;黎敏晖;黄荣溪;刘迪键;黄钰雯;张鹏;苏振鸿;周海垚;张家豪;铛铛当;吴霆豪;郭钊沐;Johnny;刘嵩;梁柏玮;彭梓浩;廖舒灏;不可视寒月;张钰彬;欧阳镒;梁泓滔;王慧霞;王佳龙;吕希;吴经理;杨广贤;黄添翼;苏;冯柏豪;崔伟健;黄文骏;朱工;谭泳茵;杨诺;卐;庄易;韩浚阳;管志成;莫玉桃;莫敏聪;陈健鹏;陈廷恩;梁健明;邱嘉晟;杨胜聪;黄楚霖;刘帆;王志文;王筝;王郅成;赵攸清;侯锡坤;孙嘉隆;梁颖斌;郭一杰;陈子;卢明裕;彭溢;缪家成;陈晓玲;刘汉中;李旺;袁自力;陈先生(5717);董任驰;董强强;Ladd;王逸秋;黄晓宇;谢健;彭乙夏;杜开广;杜操;鱼卷;钱鹏;蔡旺;赖志豪;陈壬询;静云;valink;简智濠;陈丽怡;林泽伟;黄景祥;温国荣;庄崇尧;陈泳祺;陈崇标;陈强;汪俊;陈新;张俊楠;陈永军;林镇;许卓安;吴家乐;杨泽武;张姣;余耿烨;莫俊朗;徐夏帆;陈海;郑子铭;方辉;杨宇;黄子睿;钟纬峰;朱文浩;陆镰文;李俊;何俊毅;黄子洋;郑鸿生;潘梦雪;郭泰槟;孙野;郭恒嘉;黄丽春;郑焕坡;柯科勇;谢晶莹;朱海瑶;王新阳;周若瑾;Kylie LIN;谢冬洁;杨帅;杨泽冰;李兆阳;陈雅明;张昊彦;boatboat;许杰亮;黄睿;黄永胜;张兰勤;陈皖;Ken Luo;戴逸程;刘炜;彭志豪;张瑞朋;杨耀武;陈雨奇;吴欢;罗颂;戴玮;陈冠旭;胡景林;谢琅;冯永;吴锦豪;郭焰辉;徐梓燕;孙兴卓;周明悦;梁梓鹏;吴林锋;伍裕平;林卓贤;王培成;何胤康;张云龙;王奇峰;白水木木;黄特金;李忠锐;黄漪颖;许子同;洪明宋;梁滋林;李焯豪;曹珍;黄生;沈桐;吴勋宇;陈婷;李海彬;陈耿梵;王帅;陈小姐;罗铖;黄玉海;froggengo;陈宇晴;李少霞;陈永钦;关颜名;陈琦;杨万里;赵孙辉;洪铭;符多亮;王天来;邓宇婷;褚一璠;余万丽;刘剑锋;潘世华;劳汉铭;许晓洁;刘贤涛;潘钜涛;林雪莹;范镇怀;吴英文;庾峻玮;郑绵廷;陈敏豪;丁永兵;陈剑宇;蔡子逸;罗熹;卢林浩;张奔;聂韵盈;韦东辉;朱先生;韦明发;李健民;周劲冬;熊辉;杨章;谢伟豪;陈湘杰;陈鹏宇;strawleave;黄志华;宋斌;肖沐宸;林泽贤;Hlynford;孙匡正;马敏敏;陈浩云;何懿铭;谢太阳;杨晓文;文若昀;蔡灿城;黎海明;侯骅十;曾晓霞;陈燕婷;张富源;颜生;盘恩婷;郭沛伦;陈涛;冯希哲;吴雨露;牛湘淋;黄英杰;梁良基;郭志伟;尤海正;吴琼杰;陈奖;郑华健;翁坚铨;乱;Ling;吴志朝;陈楚松;钱美铟;159****5427;谢馥荫;刘广龙;聂磊;何炫铿;罗维康;邹力衡;张辉煌;黄伟亮;张生;胡夏云;陈嘉俊;林意颖;林潇鸿;Bong;刘黄兰;吕颜辉;王洁宜;龙海;林珊珊;彭东东;韦明江;陈浩晨;贺锦润;邝美琪;钟其麟;郑海钏;梁嘉雯;温鸾飞;肖文瀚;林洁丹;郑汇裕;杨圆;简流异;白厶合;ElisaYazidi;薛佺;邓慧玲;许彬;杨舒淇;李通;李凯祥;黄昱;郭倩莹;白梓洋;余委杰;张泽伟;冯锵健;陈俊凯;饶权斌;梁锐;Victoria Liu;朱春阳;林炜;罗森章;黄光辉;王宇亮;徐晓敏;邱淑帆;何莹莹;吴显帝;神碧丹;何楚翘;袁静怡;黄益汉;张朝沐;刘海韵;黄文添;谭锦岳;姜志发;吴林添;梁洳菲;刘文林;陈妍如;钟玲玲;胡琳淳;马棉涛;李秋晓;陈贵清;陈苑苗;叶钊;白冰;梁昊辉;郑宇涵;朱睿彬;梁天铭;彭积良;骆晓劲;杨明;张圣铭;王钊良;冯讯铭;胡艺展;陈梓筠;周炀晓;欧慧怡;郑凯妍;胡海珊;刘林莹;黄嘉嘉;袁佳辉;熊烨婷;陈浚淇;李楚茹;郑浩杰;叶崇培;刘炜坤;李樱爱;黄嘉豪;蔡佳创;郭智乐;许敏;刘福安;叶文滔;蔡楚宏;陈博雅;纪桂香;朱钿纯;陈乙德;赖鸿宇;汤洪;黄宇昂;王曦彤;蔡俊益;黄楷;陈镇欣;蔡尔曼;张桐铭;林泽帆;叶素讯;邹沛言;陈国禹;朱梓练;悉悉;赵畅;梁桐瑞;马舒琪;林雪宜;赖宇楠;林舜邦;程猛海;吴志恒;林子洪;陈晓绵;周城乐;卢宇立;蔡昊文;高炜;陈楷建;黄香瑞;小周;黄卓广;周浩锋;苏德坚;钟雨栗;潘海鹏;黄秋洁;李嘉雄;琴闻萧;陈琦升;陈先生(2311);何灏;欧阳莉;黄显雅;罗新宇;谢俊星;文再文;黄伟胜;巫海青;黄文铸;李昀昆;李惊;黄鑫辉;梁晓云;廖家杰;王宇超;邱纪涛;程塨;郑润琪;赵子婧;蒋志强;江秉隽;袁子越;刘现东;黄健珍;王凯楠;欧展鹏;陈成晟;张景清;吴保浩;董文球;袁鸿基;周及时;马林楷;严伟浩;胡月明;乔海鸣;梁嘉岚;沈豙耳;刘佳;Emma;李晨昕;傅瑞丹;韩振峰;蔡志健;向;余;wx;曾江河;李华喜;刘邦兴;李秋玲;小天;颜华;吴炫其;陈卓希;梁文灏;黄启东;郑柏昆;林敬明;吴莉莉;陈佳;张祖青;王丹杏;李嘉欣;张宇;吴洁珊;陈美旋;张园酉;陈昱潼;母仕星;邱丽霞;罗永高;段占南;朱珍妮;湛朝禧;陈振钊;彭东城;林婵芬;莫昌燊;周先生;王先生;马清清;简志成;张云峰;陆兴华;袁敏;潘敏思;周志昊;杨武剑;胡水馨;姚先生;杨诗柳;王雅虹;周阳;郝方润;王建力;曹星烨;张如章;钟文凯;梁沅楠;陆江越;杨诗昊;张垒;steven;聂杞锋;张文理;陈艺文;容永康;温天伟;邓斯楚;周刊;梁锐鹏;林晓亮;朱林文;高司捷;陈彩连;胡天朗;林晓宇;谭云龙;常磊鑫;Li;14767753450;朱晨;李志帆;陈土权;Robin;何生;王志康;李伟兵;张毅波;洪仰博;颜禄瀚;邹家豪;彭卓龙;梁乾阳;唐诒琳;陈权宇;邓贵钊;邓家煊;陈东;王夏桐;夏光文;于如燕;朱程峰;陆永昊;杨福伟;彭镇贵;张传武;刘晓恩;梅西;黄明明;王锦成;古志威;廖文生;陈觉敏;胡;敖平;陈佳忻;李卓璋;姚文斌;张润翔;王旭阳;苏文轩;薛锦涛;蔡嘉豪;黄伟杰;闫法睿;黄春涵;林润鑫;Sofi;李敏君;蒋球;筱佩;杨洋;邱均伟;刘洁莹;李正楠;陈敏骏;张庆琳;奂迦钟;郑卓武;周浩;黄景新;何建超;谢坤钿;梅栋亮;高华伟;刘海涛;刘威博;陈哲湟;冯俊华;陈泽轩;卢东;杨坜烽;邓浩驰;倪梓博;钱裕燊;LYu;赵孜博;杨沛;林桐庆;庞东东;骆海辉;陈玉彬;薛伟汛;黎嘉辉;饶祖鸿;陈聪;陈垲蓥;宣丞;刘易;冯茗楷;侯先生;王;王博;黄强;陈锐铭;杨宇凤;王铭慧;刘付源;黎志清;张嘉豪;刘煜桢;高建锋;邱思齐;冼世华;郭振东;梁晓城;Chrisio Gwaan;何艺彬;阳楠;曾凌彬;吕茜桐;吴卓豪;张泽鼎;叶新超;陈艺云;康;彭文儒;胡竣铭;曾凡铖;伍楷城;高俊博;陈政宇;孔德渝;鄢汀洋;吴春妮;范文彬;林时猛;李泳棋;黎子炫;盘浩炫;曾晓帆;许哲曦;王嘉炜;李俊佑;曹先生;曹;徐凤年;殷华生;罗祖锋;孔良柘;江帆;何盖典;张胜涛;丁晓鹏;陈昊岚;黄明富;古嘉铄;吴志洪;陈秋兰;廖美欣;欧莉婷;李煜华;汪天怡;樊子淇;李旭晴;刘生;周娜;蔡扬航;黄越;吴松锐;麦健辉;Yi;李林;刘冠宏;杨宗儒;胡兆锋;陈立;何嘉成;宋佩真;刘树鑫;刘浩然;马嘉霖;胡漠杨;199****7014;邹红伟;赵振宇;叶小姐;邹毅贤;Fei Yuan;谭嘉荣;霍清驰;胡建星;张凡;Mary Wang;魏俊;徐伟臻;杨海涵;杨晓庭;杜光辉;韦灏;范浩坤;文涛;张亮;张叶;曹宇;陶文亮;Chen;李秋实;泳铭;vigi;胡琦;莫嘉文;陈洁;长明若何;曾嘉琪;朱汇祺;莫振翰;党群;黎鹏;徐州;何景李;张裕;钟先生;FredWang;刘;郭阳振;赖泽平;成思敏;刁艺琦;叶航;陈志鑫;李长春;梁耀锦;苦味仔;董禹;张志坚;蔡洽颖;陈胜;冯;余建斌;刘海辉;杨嘉琪;李静君;林昊彦;刘培养;丁国洪;唐超;Dyllen;马泽鸿;严颖;何建宏;侯仰广;吕炜杰;王赞喻;刘澳秋;Mr. Jian;陶志琛;郑子凌;陈有峰;刘光创;兔航;简伟林;李颖福;周安泽;陈润民;张伟龙;胡海平;吴兆麟;赵辰;贺敬豪;黄荣基;练鹏程;张先生;邓国艺;许洁;吴毅凡;李嘉楠;老锅儿";
//领导人员名单
var leaderArr = [];
//未中奖人员名单
var remainPerson = allPerson.toString().split(";");
//中奖人员名单
var luckyMan = [];
var timer;//定时器
var times = 1;//抽奖次数,如果不是第一次，不加粗显示领导姓名
$(function () {
    iconAnimation();
    //开始抽奖
    $("#btnStart").on("click", function () {
        //判断是开始还是结束
        if ($("#btnStart").text() === "开始") {
            if (!$("#txtNum").val()) {
                showDialog("请输入中奖人数");
                return false;
            }
            if ($("#txtNum").val() > 49) {
                showDialog("一次最多只能输入49人");
                return false;
            }
            if ($("#txtNum").val() > remainPerson.length) {
                showDialog("当前抽奖人数大于奖池总人数<br>当前抽奖人数：<b>" + $("#txtNum").val() + "</b>人,奖池人数：<b>" + remainPerson.length + "</b>人");
                return false;
            }
            $("#result").fadeOut();
            //显示动画框，隐藏中奖框
            $("#luckyDrawing").show().next().addClass("hide");
            move();
            $("#btnStart").text("停止");
            $("#bgLuckyDrawEnd").removeClass("bg");
        }
        else {
            $("#btnStart").text("开始");//设置按钮文本为开始
            var luckyDrawNum = $("#txtNum").val();
            startLuckDraw();//抽奖开始

            $("#luckyDrawing").fadeOut();
            clearInterval(timer);//停止输入框动画展示
            $("#luckyDrawing").val(luckyMan[luckyMan.length - 1]);//输入框显示最后一个中奖名字
            $("#result").fadeIn().find("div").removeClass().addClass("p" + luckyDrawNum);//隐藏输入框，显示中奖框
            $("#bgLuckyDrawEnd").addClass("bg");//添加中奖背景光辉
            $("#txtNum").attr("placeholder", "输入中奖人数(" + remainPerson.length + ")");
        }
    });

    $("#btnReset").on("click", function () {
        //确认重置对话框
        var confirmReset = false;
        showConfirm("确认重置吗？所有已中奖的人会重新回到抽奖池！", function () {
            //熏置未中奖人员名单
            remainPerson = allPerson.toString().split(";");
            //中奖人数框置空
            $("#txtNum").val("").attr("placeholder", "请输入中奖人数");
            $("#showName").val("");
            //隐藏中奖名单,然后显示抽奖框
            $("#result").fadeOut();//.prev().fadeIn()
            $("#bgLuckyDrawEnd").removeClass("bg");//移除背景光辉
            times++;
            console.log(times);

        });
    });
});

//抽奖主程序
function startLuckDraw() {
    //抽奖人数
    var luckyDrawNum = $("#txtNum").val();
    if (luckyDrawNum > remainPerson.length) {
        alert("抽奖人数大于奖池人数！请修改人数。或者点重置开始将新一轮抽奖！");
        return false;
    }
    //随机中奖人
    var randomPerson = getRandomArrayElements(remainPerson, luckyDrawNum);
    var tempHtml = "";
    $.each(randomPerson, function (i, person) {
        if (leaderArr.indexOf(person) > -1 && times == 1) {
            tempHtml += "<span><b>" + person + "</b></span>";
        }
        else {
            tempHtml += "<span>" + person + "</span>";
        }
    });
    $("#result>div").html(tempHtml);
    //剩余人数剔除已中奖名单
    remainPerson = remainPerson.delete(randomPerson);
    //中奖人员
    luckyMan = luckyMan.concat(randomPerson);
    //设置抽奖人数框数字为空
    $("#txtNum").val("");
}

//参考这篇文章：http://www.html-js.com/article/JS-rookie-rookie-learned-to-fly-in-a-moving-frame-beating-figures
//跳动的数字
function move() {
    var $showName = $("#showName"); //显示内容的input的ID
    var interTime = 30;//设置间隔时间
    timer = setInterval(function () {
        var i = GetRandomNum(0, remainPerson.length);
        $showName.val(remainPerson[i]);//输入框赋值
    }, interTime);
}

//顶上的小图标，随机动画
function iconAnimation() {
    var interTime = 200;//设置间隔时间
    var $icon = $("#iconDiv>span");
    var arrAnimatoin = ["bounce", "flash", "pulse", "rubberBand", "shake", "swing", "wobble", "tada"];
    var timer2 = setInterval(function () {
        var i = GetRandomNum(0, $icon.length);
        var j = GetRandomNum(0, arrAnimatoin.length);
        //console.log("i:" + i + ",j:" + j);
        $($icon[i]).removeClass().stop().addClass("animated " + arrAnimatoin[j]);//输入框赋值
    }, interTime);

}
